Maniak003/BluZ/stm32cubeide/BluZ_LPM/STM32_WPAN/App/bluz_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    BluZ_app.c
  * @author  MCD Application Team
  * @brief   BluZ_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "log_module.h"
#include "app_ble.h"
#include "ll_sys_if.h"
#include "dbg_trace.h"
#include "ble.h"
#include "bluz_app.h"
#include "bluz.h"
#include "stm32_rtos.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stm32_lpm.h>
#include <ble_raw_api.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

typedef enum
{
  Rx_NOTIFICATION_OFF,
  Rx_NOTIFICATION_ON,
  Tx_NOTIFICATION_OFF,
  Tx_NOTIFICATION_ON,
  /* USER CODE BEGIN Service1_APP_SendInformation_t */

  /* USER CODE END Service1_APP_SendInformation_t */
  BLUZ_APP_SENDINFORMATION_LAST
} BLUZ_APP_SendInformation_t;

typedef struct
{
  BLUZ_APP_SendInformation_t     Rx_Notification_Status;
  BLUZ_APP_SendInformation_t     Tx_Notification_Status;
  /* USER CODE BEGIN Service1_APP_Context_t */

  /* USER CODE END Service1_APP_Context_t */
  uint16_t              ConnectionHandle;
} BLUZ_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */
extern uint16_t MTUSizeValue;
/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static BLUZ_APP_Context_t BLUZ_APP_Context;

uint8_t a_BLUZ_UpdateCharData[247];

/* USER CODE BEGIN PV */
typedef struct
{
  BLUZ_Data_t TxData;
  uint8_t connectionstatus;
} BLUZ_App_Context_t;

BLUZ_App_Context_t BZ_Context;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void BLUZ_Rx_SendNotification(void);
static void BLUZ_Tx_SendNotification(void);

/* USER CODE BEGIN PFP */
//static uint8_t Notification_Data_Buffer[DATA_NOTIFICATION_MAX_PACKET_SIZE]; /* DATA_NOTIFICATION_MAX_PACKET_SIZE data + CRC */
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void BLUZ_Notification(BLUZ_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_Notification_1 */

  /* USER CODE END Service1_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_Notification_Service1_EvtOpcode */

    /* USER CODE END Service1_Notification_Service1_EvtOpcode */

    case BLUZ_RX_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char1_NOTIFY_ENABLED_EVT */
    	connectFlag = true;
      	//UTIL_LPM_SetStopMode(1U << CFG_LPM_LOG, UTIL_LPM_DISABLE);
    	//connectFlag = true;
    	//MX_GPIO_Init();
    	//HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
      /* USER CODE END Service1Char1_NOTIFY_ENABLED_EVT */
      break;

    case BLUZ_RX_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char1_NOTIFY_DISABLED_EVT */
    	connectFlag = false;
      /* USER CODE END Service1Char1_NOTIFY_DISABLED_EVT */
      break;

    case BLUZ_TX_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN Service1Char2_WRITE_NO_RESP_EVT */
    	void calcPulseLevel(void);
    	/* Прием данных со смартфона */
		if (p_Notification->DataTransfered.Length > 10) {
			/* Прием данных */
			if (p_Notification->DataTransfered.p_Payload[0] == (uint8_t) '<'
			  && p_Notification->DataTransfered.p_Payload[1] == (uint8_t) 'S'
			  && p_Notification->DataTransfered.p_Payload[2] == (uint8_t) '>') {
				/* Проверка контрольной суммы */
				uint16_t checkSumm = 0;
				for (int iii = 0; iii < p_Notification->DataTransfered.Length - 3; iii++) {
					checkSumm = checkSumm + p_Notification->DataTransfered.p_Payload[iii];
				}
				/* Контрольная сумма в передаче */
				uint16_t checkSummTest = p_Notification->DataTransfered.p_Payload[242] | (uint16_t) p_Notification->DataTransfered.p_Payload[243] << 8;

				/* Сравниваем контрольные суммы */
				if (checkSummTest == checkSumm) {
					#ifdef DEBUG_USER
					bzero((char *) uartBuffer, sizeof(uartBuffer));
					sprintf(uartBuffer, "CS correct: %u, Ln: %u\n\r", checkSumm, p_Notification->DataTransfered.Length);
					HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, strlen(uartBuffer), 100);
					#endif
                    /*
                    * Формат буфера настроек
                    *
                    * 0,1,2         - Маркер <S>
                    * 3             - Режим
                    *                   0 - Настройки
                    *                   1 - Команда очистки буфера спектра
                    *                   2 - Запуск/Останов спектрометра
                    *                   3 - Очистка буфера дозиметра
                    *                   4 - Очистка лога
                    *                   5 - Запрос на передачу спектра истории превышений
                    *
                    * 4,5,6,7       - Первый порог в uR
                    * 8,9,10,11     - Второй порог в uR
                    * 12,13,14,15   - Третий порог в uR
                    * 16,17,18,19   - Коэффициент пересчета CPS в uR
                    * 20            - Битовые флаги управления светодиодом, звуком и вибро
                    *                   0 - Светодиодная индикация прихода частицы (1 - включена, 0 - выключена)
                    *                   1 - Звуковое сопровождение прихода частицы  (1 - включено, 0 - выключено)
                    *                   2 - Звуковая сигнализация 1 порог   (1 - включено, 0 - выключено)
                    *                   3 - Звуковая сигнализация 2 порог   (1 - включено, 0 - выключено)
                    *                   4 - Звуковая сигнализация 3 порог   (1 - включено, 0 - выключено)
                    *                   5 - Вибро сигнализация 1 порог   (1 - включено, 0 - выключено)
                    *                   6 - Вибро сигнализация 2 порог   (1 - включено, 0 - выключено)
                    *                   7 - Вибро сигнализация 3 порог   (1 - включено, 0 - выключено)
                    * 21,22,23,24   - Коэффициент A полинома преобразования канала в энергию.
                    * 25,26,27,28   - Коэффициент B полинома преобразования канала в энергию.
                    * 29,30,31,32   - Коэффициент C полинома преобразования канала в энергию.
                    * 33,34         - Уровень высокого напряжения
                    * 35,36         - Уровень компаратора
                    * 37			- Разрешение. 0 - 1024, 1 - 2048, 2 - 4096
                    * 38			- Битовые флаги управления прибором
                    * 					0 - Запуск набора спектра при включении.
                    * 					1 -|
                    * 					2 -| Время выборки АЦП - 3 бита от 0 до 7
                    * 					3 -|
                    * 					4 -
                    * 					5 -
                    * 					6 -
                    * 					7 -
                    * 63, 64		- Точность расчета для дозиметра. Количество импульсов в усреднении.
                    *
                    * 242, 243      - Контрольная сумма
                    */
					if (p_Notification->DataTransfered.p_Payload[3] == 0) {									// 0 - Настройки
						LEDEnable = p_Notification->DataTransfered.p_Payload[20] & 0b00000001;				// LED
						SoundEnable = p_Notification->DataTransfered.p_Payload[20] & 0b00000010;			// Sound
						levelSound1 = p_Notification->DataTransfered.p_Payload[20] & 0b00000100;			// Звук для первого порога
						levelSound2 = p_Notification->DataTransfered.p_Payload[20] & 0b00001000;			// Звук для второго порога
						levelSound3 = p_Notification->DataTransfered.p_Payload[20] & 0b00010000;			// Звук для третьего порога
						levelVibro1 = p_Notification->DataTransfered.p_Payload[20] & 0b00100000;			// Вибро для первого порога
						levelVibro2 = p_Notification->DataTransfered.p_Payload[20] & 0b01000000;			// Вибро для второго порога
						levelVibro3 = p_Notification->DataTransfered.p_Payload[20] & 0b10000000;			// Вибро для третьего порога
						autoStartSpecrometr = p_Notification->DataTransfered.p_Payload[38] & 0b00000001;	// Запуск набора спектра при включении
						uint8_t tmpSample = (p_Notification->DataTransfered.p_Payload[38] >> 1) & 0x7;		// Время выборки АЦП (0..7)

