Maniak003/BluZ/stm32cubeide/BluZ_LPM/STM32_WPAN/App/bluz_app.c
						/* Уровень порога 1 в uR/h */
						level1 = p_Notification->DataTransfered.p_Payload[7]
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[6] << 8) & 0x0000FF00)
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[5] << 16) & 0x00FF0000)
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[4] << 24)  & 0xFF000000);

						/* Уровень порога 2 в uR/h */
						level2 = p_Notification->DataTransfered.p_Payload[11]
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[10] << 8) & 0x0000FF00)
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[9] << 16) & 0x00FF0000)
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[8] << 24)  & 0xFF000000);

						/* Уровень порога 3 в uR/h */
						level3 = p_Notification->DataTransfered.p_Payload[15]
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[14] << 8) & 0x0000FF00)
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[13] << 16) & 0x00FF0000)
							| (((uint32_t) p_Notification->DataTransfered.p_Payload[12] << 24)  & 0xFF000000);

						/* Коэффициент пересчета CPS в uR/h */
						calcCoeff.Uint[3] = p_Notification->DataTransfered.p_Payload[16];
						calcCoeff.Uint[2] = p_Notification->DataTransfered.p_Payload[17];
						calcCoeff.Uint[1] = p_Notification->DataTransfered.p_Payload[18];
						calcCoeff.Uint[0] = p_Notification->DataTransfered.p_Payload[19];

						/* Коэффициент A полинома преобразования канала в энергию для 1024 */
						enCoefA1024.Uint[3] = p_Notification->DataTransfered.p_Payload[21];
						enCoefA1024.Uint[2] = p_Notification->DataTransfered.p_Payload[22];
						enCoefA1024.Uint[1] = p_Notification->DataTransfered.p_Payload[23];
						enCoefA1024.Uint[0] = p_Notification->DataTransfered.p_Payload[24];

						/* Коэффициент B полинома преобразования канала в энергию для 1024 */
						enCoefB1024.Uint[3] = p_Notification->DataTransfered.p_Payload[25];
						enCoefB1024.Uint[2] = p_Notification->DataTransfered.p_Payload[26];
						enCoefB1024.Uint[1] = p_Notification->DataTransfered.p_Payload[27];
						enCoefB1024.Uint[0] = p_Notification->DataTransfered.p_Payload[28];

						/* Коэффициент C полинома преобразования канала в энергию для 1024 */
						enCoefC1024.Uint[3] = p_Notification->DataTransfered.p_Payload[29];
						enCoefC1024.Uint[2] = p_Notification->DataTransfered.p_Payload[30];
						enCoefC1024.Uint[1] = p_Notification->DataTransfered.p_Payload[31];
						enCoefC1024.Uint[0] = p_Notification->DataTransfered.p_Payload[32];

						/* Коэффициент A полинома преобразования канала в энергию для 2048 */
						enCoefA2048.Uint[3] = p_Notification->DataTransfered.p_Payload[39];
						enCoefA2048.Uint[2] = p_Notification->DataTransfered.p_Payload[40];
						enCoefA2048.Uint[1] = p_Notification->DataTransfered.p_Payload[41];
						enCoefA2048.Uint[0] = p_Notification->DataTransfered.p_Payload[42];

						/* Коэффициент B полинома преобразования канала в энергию для 2048 */
						enCoefB2048.Uint[3] = p_Notification->DataTransfered.p_Payload[43];
						enCoefB2048.Uint[2] = p_Notification->DataTransfered.p_Payload[44];
						enCoefB2048.Uint[1] = p_Notification->DataTransfered.p_Payload[45];
						enCoefB2048.Uint[0] = p_Notification->DataTransfered.p_Payload[46];

						/* Коэффициент C полинома преобразования канала в энергию для 2048 */
						enCoefC2048.Uint[3] = p_Notification->DataTransfered.p_Payload[47];
						enCoefC2048.Uint[2] = p_Notification->DataTransfered.p_Payload[48];
						enCoefC2048.Uint[1] = p_Notification->DataTransfered.p_Payload[49];
						enCoefC2048.Uint[0] = p_Notification->DataTransfered.p_Payload[50];

						/* Коэффициент A полинома преобразования канала в энергию для 4096 */
						enCoefA4096.Uint[3] = p_Notification->DataTransfered.p_Payload[51];
						enCoefA4096.Uint[2] = p_Notification->DataTransfered.p_Payload[52];
						enCoefA4096.Uint[1] = p_Notification->DataTransfered.p_Payload[53];
						enCoefA4096.Uint[0] = p_Notification->DataTransfered.p_Payload[54];

						/* Коэффициент B полинома преобразования канала в энергию для 4096 */
						enCoefB4096.Uint[3] = p_Notification->DataTransfered.p_Payload[55];
						enCoefB4096.Uint[2] = p_Notification->DataTransfered.p_Payload[56];
						enCoefB4096.Uint[1] = p_Notification->DataTransfered.p_Payload[57];
						enCoefB4096.Uint[0] = p_Notification->DataTransfered.p_Payload[58];

						/* Коэффициент C полинома преобразования канала в энергию для 4096 */
						enCoefC4096.Uint[3] = p_Notification->DataTransfered.p_Payload[59];
						enCoefC4096.Uint[2] = p_Notification->DataTransfered.p_Payload[60];
						enCoefC4096.Uint[1] = p_Notification->DataTransfered.p_Payload[61];
						enCoefC4096.Uint[0] = p_Notification->DataTransfered.p_Payload[62];

						/* Точность усреднения для дозиметра, количество импульсов */
						dozimetrAquracy = p_Notification->DataTransfered.p_Payload[63] | ((uint16_t) p_Notification->DataTransfered.p_Payload[64] << 8);

						/* Разрядность канала */
						if (p_Notification->DataTransfered.p_Payload[65] < 16 || p_Notification->DataTransfered.p_Payload[65] > 32) {
							bitsOfChannal = CAPCHAN;
						} else if (bitsOfChannal != (uint32_t) p_Notification->DataTransfered.p_Payload[65]) {
							bitsOfChannal = (uint32_t) p_Notification->DataTransfered.p_Payload[65];
							CoefChan = 65535.0 / (double) bitsOfChannal;
						}

						/* Уровни компаратора и высокого напряжения */
						HVoltage = p_Notification->DataTransfered.p_Payload[33] | (p_Notification->DataTransfered.p_Payload[34] << 8);
						comparatorLevel = p_Notification->DataTransfered.p_Payload[35] | (p_Notification->DataTransfered.p_Payload[36] << 8);

						/* Разрешение спектра. 0 - 1024, 1 - 2048, 2 - 4096 */
						if ((resolutionSpecter != (spectrResolution_t) p_Notification->DataTransfered.p_Payload[37]) || currentSamplingTime != tmpSample) {
							resolutionSpecter = (spectrResolution_t) p_Notification->DataTransfered.p_Payload[37];
							currentSamplingTime = tmpSample;
							/* Если разрешение или время выборки изменяется - нужно очистить спектр */
							for (int iii = 0; iii < MAX_RESOLUTION; iii++) {
								tmpSpecterBuffer[iii] = 0;
							}
							spectrometerPulse = 0;
							spectrometerTime = 0;
							logUpdate(resSpectrometerLog);
							/* Если включен спектрометр, нужно установить тип передачи */
							if (dataType > onlyDozimeter) {
								switch (resolutionSpecter) {
								case resolution1024:
									dataType = dozimeterSpecter1024;
									break;
								case resolution2048:
									dataType = dozimeterSpecter2048;
									break;
								case resolution4096:
									dataType = dozimeterSpecter4096;
									break;
								default:
									dataType = dozimeterSpecter1024;
									resolutionSpecter = resolution1024;
									break;
								}
							}
						}

						/* Вывод конфига для отладки */
						#ifdef DEBUG_USER
						bzero((char *) uartBuffer, sizeof(uartBuffer));
						sprintf(uartBuffer, "CompLev: %u, HVolt: %u, Koef: %f, Res: %u\n\r", comparatorLevel, HVoltage, calcCoeff.Float, resolution);
						HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, strlen(uartBuffer), 100);
						bzero((char *) uartBuffer, sizeof(uartBuffer));
						sprintf(uartBuffer, "CoefA: %f, CoefB: %f, CoefC: %f\n\r", enCoefA.Float, enCoefB.Float, enCoefC.Float);
						HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, strlen(uartBuffer), 100);
						bzero((char *) uartBuffer, sizeof(uartBuffer));
						sprintf(uartBuffer, "Lev1: %d, Lev2: %d, Lev3: %d\n\r", level1, level2, level3);
						HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, strlen(uartBuffer), 100);
						bzero((char *) uartBuffer, sizeof(uartBuffer));
						sprintf(uartBuffer, "calcCoeff: %f\n\r", calcCoeff.Float);
						HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, strlen(uartBuffer), 100);
						#endif

						/* Установка уровней для компаратора и высокого напряжения */
						setLevelOnPort(CHANNEL_A, comparatorLevel);
						setLevelOnPort(CHANNEL_B, HVoltage);
						/*
						 * TODO -- не получается разобраться, почему запись выполняется со второго раза.
						 * Первый вызов стирает Flash и только на втором происходит запись.
						 *
						 */
						writeFlash();
						calcPulseLevel();	 // Обновление порогов
						logUpdate(writeFlashLog);

					/* Очистка буфера спектра */
					} else if (p_Notification->DataTransfered.p_Payload[3] == 1) {		// Очистка буфера спектрометра
						for (int iii = 0; iii < MAX_RESOLUTION; iii++) {
							tmpSpecterBuffer[iii] = 0;
						}
						spectrometerPulse = 0;
						spectrometerTime = 0;
						logUpdate(writeFlashLog);
					/* Включение/выключение спектрометра */
					} else if (p_Notification->DataTransfered.p_Payload[3] == 2) {		// Запуск/останов спектрометра
						HAL_ADC_Stop_DMA(&hadc4);
						HAL_ADC_DeInit(&hadc4);
						//HAL_DMA_DeInit(&handle_GPDMA1_Channel0);
						if (dataType == onlyDozimeter) {											// Переключение в режим спектрометра
							switch (resolutionSpecter) {
							case resolution1024:
								dataType = dozimeterSpecter1024;
								break;
							case resolution2048:
								dataType = dozimeterSpecter2048;
								break;
							case resolution4096:
								dataType = dozimeterSpecter4096;
								break;
							default:
								dataType = dozimeterSpecter1024;
								resolutionSpecter = resolution1024;
								break;
							}
							MX_ADC4_Init();
							//MX_GPDMA1_Init();
							HAL_ADC_Start_DMA(&hadc4, TVLevel, 1);
							//hadc4.DMA_Handle->Instance->CCR &= ~DMA_IT_HT;
							logUpdate(startSpectrometerLog);
							/* Включим ADC для одного канала */
							//MODIFY_REG(hadc4.Instance->CHSELR, ADC_CHSELR_SQ_ALL, ((ADC_CHSELR_SQ2 | ADC_CHSELR_SQ3 | ADC_CHSELR_SQ4 | ADC_CHSELR_SQ5 | ADC_CHSELR_SQ6 | ADC_CHSELR_SQ7 | ADC_CHSELR_SQ8) << (((1UL - 1UL) * ADC_REGULAR_RANK_2) & 0x1FUL)) | (hadc4.ADCGroupRegularSequencerRanks));
						} else {
							dataType = onlyDozimeter;												// Переключение в режим дозиметра
							MX_ADC4_Init();
							logUpdate(stopSpectrometerLog);
						}
					/* Сброс дозиметра */
					} else if (p_Notification->DataTransfered.p_Payload[3] == 3) {
						pulseCounter = 0;
						currentTime = 0;
						//memset(dozimetrBuffer, 0, SIZE_DOZIMETR_BUFER * 2);
						for (int ii = 0; ii < SIZE_DOZIMETR_BUFER; ii++) {
							dozimetrBuffer[ii] = 0;
						}
						logUpdate(resDozimeterLog);
					/* Очистка лога */
					} else if (p_Notification->DataTransfered.p_Payload[3] == 4) {
						for (int ii = 0; ii < LOG_BUFER_SIZE; ii++) {
							logBuffer[ii].time = 0;
							logBuffer[ii].type = 0;
						}
						logUpdate(clearLog);
					/* Запрос на передачу спектра истории */
					} else if (p_Notification->DataTransfered.p_Payload[3] == 5) {
						historyRequest = true;
						interval2 = 0;
					/* Включение звука и вибро, для поиска прибора */
					} else if (p_Notification->DataTransfered.p_Payload[3] == 6) {
						//findDevice = true;
						NotifyAct(SOUND_NOTIFY | VIBRO_NOTIFY, 5);
					}
				} else {
				}
			}

			/* Вывод приемного буфера */
			/*
			bzero((char *) uartBuffer, sizeof(uartBuffer));
			sprintf(uartBuffer, "bz_rx_app: DataTransfered\n\r");
			HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, strlen(uartBuffer), 100);
			for (int iii = 0; iii < p_Notification->DataTransfered.Length; iii++) {
				sprintf(uartBuffer, "%02X ", p_Notification->DataTransfered.p_Payload[iii]);
				HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, 3, 100);
			}
			HAL_UART_Transmit(&huart2, (uint8_t *) "\n\r", 2, 100);
			*/
		}




      /* USER CODE END Service1Char2_WRITE_NO_RESP_EVT */
      break;

    case BLUZ_TX_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_ENABLED_EVT */

      /* USER CODE END Service1Char2_NOTIFY_ENABLED_EVT */
      break;

