Maniak003/BluZ/stm32cubeide/BluZ_LPM/STM32_WPAN/App/bluz_app.c
    case BLUZ_TX_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service1Char2_NOTIFY_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_Notification_default */

      /* USER CODE END Service1_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service1_Notification_2 */

  /* USER CODE END Service1_Notification_2 */
  return;
}

void BLUZ_APP_EvtRx(BLUZ_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_APP_EvtRx_1 */

  /* USER CODE END Service1_APP_EvtRx_1 */

  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_APP_EvtRx_Service1_EvtOpcode */

    /* USER CODE END Service1_APP_EvtRx_Service1_EvtOpcode */
    case BLUZ_CONN_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_CONN_HANDLE_EVT */
      	UTIL_LPM_SetStopMode(1U << CFG_LPM_LOG, UTIL_LPM_DISABLE);
      	//uint16_t connection_handle = p_Notification->ConnectionHandle;
      	//hci_le_connection_update_cp0 cp;
      	//cp.Connection_Handle = connection_handle;
      	//cp.Conn_Interval_Min = 6;   // 7.5 ms (6 * 1.25)
      	//cp.Conn_Interval_Max = 6;   // 7.5 ms
      	//cp.Conn_Latency = 0;        // No latency
      	//cp.Supervision_Timeout = 400; // 4 seconds
      	//hci_le_set_phy(p_Notification->ConnectionHandle, 0, HCI_TX_PHYS_LE_1M_PREF, HCI_RX_PHYS_LE_1M_PREF, 0);
      	//hci_le_set_phy(p_Notification->ConnectionHandle, 0, HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF, 0);
      	//aci_l2cap_connection_parameter_update_req(p_Notification->ConnectionHandle,
      	//    40, 40,   // 50 ms
      	//    0,        // latency
      	//    500);     // timeout
      	//aci_hci_send_cmd(&cp, HCI_LE_CONNECTION_UPDATE, sizeof(cp));

      	//SystemClock_Config();
      	//PeriphCommonClock_Config();
    	//MX_GPIO_Init();
    	//MX_RTC_Init();
		//MX_LPTIM1_Init();
		//MX_LPTIM2_Init();
		//MX_TIM17_Init();
    	//connectFlag = true;
    	//HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
      /* USER CODE END Service1_APP_CONN_HANDLE_EVT */
      break;

    case BLUZ_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_DISCON_HANDLE_EVT */

      /* USER CODE END Service1_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_APP_EvtRx_default */

      /* USER CODE END Service1_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service1_APP_EvtRx_2 */

  /* USER CODE END Service1_APP_EvtRx_2 */

  return;
}

void BLUZ_APP_Init(void)
{
  UNUSED(BLUZ_APP_Context);
  BLUZ_Init();

  /* USER CODE BEGIN Service1_APP_Init */

  /* USER CODE END Service1_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void BLUZ_Rx_SendNotification(void) /* Property Notification */
{
  BLUZ_APP_SendInformation_t notification_on_off = Rx_NOTIFICATION_OFF;
  BLUZ_Data_t bluz_notification_data;

  bluz_notification_data.p_Payload = (uint8_t*)a_BLUZ_UpdateCharData;
  bluz_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char1_NS_1 */

  /* USER CODE END Service1Char1_NS_1 */

  if (notification_on_off != Rx_NOTIFICATION_OFF)
  {
    BLUZ_UpdateValue(BLUZ_RX, &bluz_notification_data);
  }

  /* USER CODE BEGIN Service1Char1_NS_Last */

  /* USER CODE END Service1Char1_NS_Last */

  return;
}

__USED void BLUZ_Tx_SendNotification(void) /* Property Notification */
{
  BLUZ_APP_SendInformation_t notification_on_off = Tx_NOTIFICATION_OFF;
  BLUZ_Data_t bluz_notification_data;

  bluz_notification_data.p_Payload = (uint8_t*)a_BLUZ_UpdateCharData;
  bluz_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char2_NS_1 */

  /* USER CODE END Service1Char2_NS_1 */

  if (notification_on_off != Tx_NOTIFICATION_OFF)
  {
    BLUZ_UpdateValue(BLUZ_TX, &bluz_notification_data);
  }

  /* USER CODE BEGIN Service1Char2_NS_Last */

  /* USER CODE END Service1Char2_NS_Last */

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
void BleStackCB_Process(void);

uint8_t sendData(uint8_t *data)
{
    if (!connectFlag) return 0;

    BZ_Context.TxData.p_Payload = data;
    BZ_Context.TxData.Length    = MTUSizeValue;

    tBleStatus ret;
    do {
        ret = BLUZ_UpdateValue(BLUZ_RX, &BZ_Context.TxData);
        if (ret == BLE_STATUS_BUSY) {          // HCI-команда не ушла
            MX_APPE_Process();                 // прокручиваем стек
        }
    } while (ret == BLE_STATUS_BUSY);

    return (ret == BLE_STATUS_SUCCESS) ? 1 : 0;
}
/*
void sendData( uint8_t *dataSpectrBufer ) {
	if (connectFlag && tx_pool_ready) {
	  tBleStatus status = BLE_STATUS_INVALID_PARAMS;
		//for (int iii = 0; iii < MTUSizeValue; iii++) {
		//	Notification_Data_Buffer[iii] = dataSpectrBufer[iii];
		//}
		//BZ_Context.TxData.p_Payload = Notification_Data_Buffer;
		BZ_Context.TxData.p_Payload = dataSpectrBufer;
		BZ_Context.TxData.Length =  MTUSizeValue;

		status = BLUZ_UpdateValue(BLUZ_RX, (BLUZ_Data_t *) &BZ_Context.TxData);

		if (status == BLE_STATUS_INSUFFICIENT_RESOURCES) {
			#ifdef DEBUG_USER
			bzero((char *) uartBuffer, sizeof(uartBuffer));
			sprintf(uartBuffer, "bz_rx_app: Error transfer with status: %d\n\r", status);
			HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, sizeof(uartBuffer), 100);
			#endif
		} else {
			//bzero((char *) uartBuffer, sizeof(uartBuffer));
			//sprintf(uartBuffer, "bz_rx_app: Send complete\n\r");
			//HAL_UART_Transmit(&huart2, (uint8_t *) uartBuffer, sizeof(uartBuffer), 100);
		}

	  BleStackCB_Process();
	}
  return;
}

*/
/* USER CODE END FD_LOCAL_FUNCTIONS */
